In this file, we're gonna start with Pandas
Pandas is a fast, flexible and easy to use open source analysis and manipulation tool, built on top of the Python language.

Pandas Series -> A pandas series is like a column in a table. It is a 1D array holding data of any type.

Now we will learn to create Series

1) Series from lists ->

In [2]:
import numpy as np
import pandas as pd

country = ["India", "Russia", "UAE", "USA", "Nepal"]

pd.Series(country)

0     India
1    Russia
2       UAE
3       USA
4     Nepal
dtype: object

From this we can see that, a series has the value and the index associated with it.
Also the data type of all the values is object because Pandas call strings as objects in 99% cases

In [3]:
runs = [11, 13, 56, 65, 89]
pd.Series(runs)

0    11
1    13
2    56
3    65
4    89
dtype: int64

We can also replace our indexes like in the below ->

In [5]:
subjects = ["Maths", "Science", "Hindi", "English"]
marks = [78, 89, 88, 90]

pd.Series(marks, index = subjects)

Maths      78
Science    89
Hindi      88
English    90
dtype: int64

We can also set up the name of our Series

In [6]:
pd.Series(marks, index = subjects, name = "Aaditya's marks")

Maths      78
Science    89
Hindi      88
English    90
Name: Aaditya's marks, dtype: int64

2) Series from Dictionary ->

In [ ]:
mark_s = {
    "Maths" : 50,
    "Hindi" : 55,
    "Computer" : 44,
}

marks_series = pd.Series(mark_s)

Maths       50
Hindi       55
Computer    44
dtype: int64

Series Attributes ->
1) Size ->

In [ ]:
import pandas as pd
mark_s = {
    "Maths" : 50,
    "Hindi" : 55,
    "Computer" : 44,
}

marks_series = pd.Series(mark_s, name = "Mere number")

marks_series.size

3

2) Dtype ->

In [5]:
marks_series.dtype

dtype('int64')

3) Name ->

In [1]:
import pandas as pd
mark_s = {
    "Maths" : 50,
    "Hindi" : 55,
    "Computer" : 44,
}

marks_series = pd.Series(mark_s, name = "Mere number")
marks_series.name

'Mere number'

4) Is Unique ->

In [ ]:
import pandas as pd
mark_s = {
    "Maths" : 50,
    "Hindi" : 55,
    "Computer" : 44,
}

marks_series = pd.Series(mark_s, name = "Mere number")
marks_series.is_unique

True

5) Index -> In this all the index values are printed

In [2]:
marks_series.index

Index(['Maths', 'Hindi', 'Computer'], dtype='object')

6) Values -> In this all the values are printed

In [3]:
marks_series.values

array([50, 55, 44])

Formation of series using real world Datasets (read_csv)->

In this we have to implement a function read.csv in which we have to pass the csv file in it i.e. Datasets. csv stands for comma separated values.

In [4]:
import pandas as pd
subs = pd.read_csv("/home/aaditya/Downloads/subs.csv")
subs

     Subscribers gained
0                    48
1                    57
2                    40
3                    43
4                    44
..                  ...
360                 231
361                 226
362                 155
363                 144
364                 172

[365 rows x 1 columns]

This obtained output is a DataFrame not series
To obtain series, we use squeeze function ->

In [8]:
print(subs.squeeze())
print(type(subs.squeeze()))

0       48
1       57
2       40
3       43
4       44
      ...
360    231
361    226
362    155
363    144
364    172
Name: Subscribers gained, Length: 365, dtype: int64
<class 'pandas.core.series.Series'>

In this subs.csv dataset, it has only one column but in the next two csv files, it contains two columns then ->

In [9]:
kohli = pd.read_csv("/home/aaditya/Downloads/kohli_ipl.csv", index_col = "match_no")
kohli

          runs
match_no
1            1
2           23
3           13
4           12
5            1
...        ...
211          0
212         20
213         73
214         25
215          7

[215 rows x 1 columns]

We have to specify which column should be the Index column which we have specified by index_col

In [10]:
kohli.squeeze()

match_no
1       1
2      23
3      13
4      12
5       1
       ..
211     0
212    20
213    73
214    25
215     7
Name: runs, Length: 215, dtype: int64

In [ ]:
movies = pd.read_csv("/home/aaditya/Downloads/bollywood.csv", index_col = "movie")
movies

                                                  lead
movie
Uri: The Surgical Strike                 Vicky Kaushal
Battalion 609                              Vicky Ahuja
The Accidental Prime Minister (film)       Anupam Kher
Why Cheat India                          Emraan Hashmi
Evening Shadows                       Mona Ambegaonkar
...                                                ...
Hum Tumhare Hain Sanam                  Shah Rukh Khan
Aankhen (2002 film)                   Amitabh Bachchan
Saathiya (film)                           Vivek Oberoi
Company (film)                              Ajay Devgn
Awara Paagal Deewana                      Akshay Kumar

[1500 rows x 1 columns]

In [ ]:
movies.squeeze()

movie
Uri: The Surgical Strike                   Vicky Kaushal
Battalion 609                                Vicky Ahuja
The Accidental Prime Minister (film)         Anupam Kher
Why Cheat India                            Emraan Hashmi
Evening Shadows                         Mona Ambegaonkar
                                              ...
Hum Tumhare Hain Sanam                    Shah Rukh Khan
Aankhen (2002 film)                     Amitabh Bachchan
Saathiya (film)                             Vivek Oberoi
Company (film)                                Ajay Devgn
Awara Paagal Deewana                        Akshay Kumar
Name: lead, Length: 1500, dtype: object

Series Methods ->

1) Head and Tail method - It gives the top 5 (by default, can be changed) rows from the dataset.

In [11]:
import pandas as pd

movies = pd.read_csv("/home/aaditya/Downloads/bollywood.csv", index_col = "movie")
movies.head()

                                                  lead
movie
Uri: The Surgical Strike                 Vicky Kaushal
Battalion 609                              Vicky Ahuja
The Accidental Prime Minister (film)       Anupam Kher
Why Cheat India                          Emraan Hashmi
Evening Shadows                       Mona Ambegaonkar

If we want we can print top 3 also, top 7,8,9 any number also ->

In [13]:
print(movies.head(3))
print(movies.head(7))

                                               lead
movie
Uri: The Surgical Strike              Vicky Kaushal
Battalion 609                           Vicky Ahuja
The Accidental Prime Minister (film)    Anupam Kher
                                                      lead
movie
Uri: The Surgical Strike                     Vicky Kaushal
Battalion 609                                  Vicky Ahuja
The Accidental Prime Minister (film)           Anupam Kher
Why Cheat India                              Emraan Hashmi
Evening Shadows                           Mona Ambegaonkar
Soni (film)                           Geetika Vidya Ohlyan
Fraud Saiyaan                                 Arshad Warsi

The role of Tail is opposite of the Head

In [ ]:
al) of these nuts before bed is generally good formovies.tail()

                                    lead
movie
Hum Tumhare Hain Sanam    Shah Rukh Khan
Aankhen (2002 film)     Amitabh Bachchan
Saathiya (film)             Vivek Oberoi
Company (film)                Ajay Devgn
Awara Paagal Deewana        Akshay Kumar

In [15]:
movies.tail(7)

                                      lead
movie
Devdas (2002 Hindi film)    Shah Rukh Khan
Kaante                    Amitabh Bachchan
Hum Tumhare Hain Sanam      Shah Rukh Khan
Aankhen (2002 film)       Amitabh Bachchan
Saathiya (film)               Vivek Oberoi
Company (film)                  Ajay Devgn
Awara Paagal Deewana          Akshay Kumar

2) Sample -> It takes our one random row from the dataset.
By default it returns one row, if we want more then we can specify the number

In [22]:
movies.sample()

                         lead
movie
Namastey London  Akshay Kumar

In [37]:
movies.sample(3)

                                      lead
movie
Hawayein                        Babbu Mann
Daawat-e-Ishq            Aditya Roy Kapoor
Ek Chalis Ki Last Local         Abhay Deol

3) Value counts -> If we want to know that an actor has done how much movies then through it we can find out, it will give result in descending order

In [38]:
movies.value_counts()

lead
Akshay Kumar        48
Amitabh Bachchan    45
Ajay Devgn          38
Salman Khan         31
Sanjay Dutt         26
                    ..
Naveen Bawa          1
Naushaad Abbas       1
Nauheed Cyrusi       1
Natalia Janoszek     1
Nishikant Kamat      1
Name: count, Length: 566, dtype: int64

4) Sort values -> It sorts out the values of the dataset in ascending order
If we want in descending order then write - ascending = False

In [44]:
kohli = (pd.read_csv("/home/aaditya/Downloads/kohli_ipl.csv", index_col = "match_no")).squeeze()

print(kohli.sort_values())
print(kohli.sort_values(ascending = False))

match_no
8        0
87       0
93       0
91       0
206      0
      ...
164    100
120    100
123    108
126    109
128    113
Name: runs, Length: 215, dtype: int64
match_no
128    113
126    109
123    108
120    100
164    100
      ...
93       0
130      0
206      0
207      0
211      0
Name: runs, Length: 215, dtype: int64

This sorting is temporary means it does not change the original dataset
To change the original dataset, pass the parameter - inplace = True

5) Sort Index -> It sorts out the index of the dataset in the ascending or alphabetical order
inplace = True works here, ascending = True works here

In [45]:
movies.sort_index()

                                        lead
movie
1920 (film)                 Rajniesh Duggall
1920: London                   Sharman Joshi
1920: The Evil Returns           Vicky Ahuja
1971 (2007 film)              Manoj Bajpayee
2 States (2014 film)            Arjun Kapoor
...                                      ...
Zindagi 50-50                    Veena Malik
Zindagi Na Milegi Dobara      Hrithik Roshan
Zindagi Tere Naam         Mithun Chakraborty
Zokkomon                     Darsheel Safary
Zor Lagaa Ke...Haiya!          Meghan Jadhav

[1500 rows x 1 columns]

Series maths methods ->

1) Count - It gives the total number of items in the series. It does not count Nan values.

In [1]:
import pandas as pd
kohli = (pd.read_csv("/home/aaditya/Downloads/kohli_ipl.csv", index_col = "match_no")).squeeze()

kohli.count()

np.int64(215)

2) Sum and Product - It calculates the sum and product of all the items of the series

In [3]:
subs = (pd.read_csv("/home/aaditya/Downloads/subs.csv").squeeze())
subs.sum()

np.int64(49510)

In [4]:
subs.product()

np.int64(0)

3) Mean, Median, Mode, Standard Var, Variance ->

In [14]:
print(subs.mean())
print(kohli.median())
print(kohli.std())
print(subs.mode())
print(subs.var())

135.64383561643837
24.0
26.22980132830278
0    105
Name: Subscribers gained, dtype: int64
3928.1585127201565

4) Min/Max ->

In [15]:
print(subs.min())
print(kohli.max())

33
113

5) Describe -> It gives all the mathematical summary

In [17]:
kohli.describe()

count    215.000000
mean      30.855814
std       26.229801
min        0.000000
25%        9.000000
50%       24.000000
75%       48.000000
max      113.000000
Name: runs, dtype: float64

Series Indexing -> It is same as the indexing for python
There is some errors in negative indexing so avoid it

Series Slicing -> It is same as the slicing for python
Negative slicing is allowed

Edit items inside a series ->

In [1]:
import pandas as pd
mark_s = {
    "Maths" : 50,
    "Hindi" : 55,
    "Computer" : 44,
}

marks_series = pd.Series(mark_s, name = "Mere number")
marks_series

Maths       50
Hindi       55
Computer    44
Name: Mere number, dtype: int64

1] If we want to increase the marks of the subject which is at the 2nd index postion then ->

In [2]:
marks_series[2] = 58
marks_series

/tmp/ipykernel_192724/1294315747.py:1: FutureWarning: Series.__setitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To set a value by position, use `ser.iloc[pos] = value`
  marks_series[2] = 58

Maths       50
Hindi       55
Computer    58
Name: Mere number, dtype: int64

2] If index postion does not exist then ->

In [3]:
marks_series["EVS"] = 60
marks_series

Maths       50
Hindi       55
Computer    58
EVS         60
Name: Mere number, dtype: int64

3] We can do editing of series by slicing too ->

In [4]:
marks_series[0:2] = [60, 60]
marks_series

Maths       60
Hindi       60
Computer    58
EVS         60
Name: Mere number, dtype: int64

Series with Python Functionalities ->

In [7]:
subs = (pd.read_csv("/home/aaditya/Downloads/subs.csv").squeeze())
print(len(subs))
print(type(subs))
print(sorted(subs)) # Stores output in list
print(min(subs), max(subs))

365
<class 'pandas.core.series.Series'>
[33, 33, 35, 37, 39, 40, 40, 40, 40, 42, 42, 43, 44, 44, 44, 45, 46, 46, 48, 49, 49, 49, 49, 50, 50, 50, 51, 54, 56, 56, 56, 56, 57, 61, 62, 64, 65, 65, 66, 66, 66, 66, 67, 68, 70, 70, 70, 71, 71, 72, 72, 72, 72, 72, 73, 74, 74, 75, 76, 76, 76, 76, 77, 77, 78, 78, 78, 79, 79, 80, 80, 80, 81, 81, 82, 82, 83, 83, 83, 84, 84, 84, 85, 86, 86, 86, 87, 87, 87, 87, 88, 88, 88, 88, 88, 89, 89, 89, 90, 90, 90, 90, 91, 92, 92, 92, 93, 93, 93, 93, 95, 95, 96, 96, 96, 96, 97, 97, 98, 98, 99, 99, 100, 100, 100, 101, 101, 101, 102, 102, 103, 103, 104, 104, 104, 105, 105, 105, 105, 105, 105, 105, 105, 105, 108, 108, 108, 108, 108, 108, 109, 109, 110, 110, 110, 111, 111, 112, 113, 113, 113, 114, 114, 114, 114, 115, 115, 115, 115, 117, 117, 117, 118, 118, 119, 119, 119, 119, 120, 122, 123, 123, 123, 123, 123, 124, 125, 126, 127, 128, 128, 129, 130, 131, 131, 132, 132, 134, 134, 134, 135, 135, 136, 136, 136, 137, 138, 138, 138, 139, 140, 144, 145, 146, 146, 146, 146, 147, 149, 150, 150, 150, 150, 151, 152, 152, 152, 153, 153, 153, 154, 154, 154, 155, 155, 156, 156, 156, 156, 157, 157, 157, 157, 158, 158, 159, 159, 160, 160, 160, 160, 162, 164, 166, 167, 167, 168, 170, 170, 170, 170, 171, 172, 172, 173, 173, 173, 174, 174, 175, 175, 176, 176, 177, 178, 179, 179, 180, 180, 180, 182, 183, 183, 183, 184, 184, 184, 185, 185, 185, 185, 186, 186, 186, 188, 189, 190, 190, 192, 192, 192, 196, 196, 196, 197, 197, 202, 202, 202, 203, 204, 206, 207, 209, 210, 210, 211, 212, 213, 214, 216, 219, 220, 221, 221, 222, 222, 224, 225, 225, 226, 227, 228, 229, 230, 231, 233, 236, 236, 237, 241, 243, 244, 245, 247, 249, 254, 254, 258, 259, 259, 261, 261, 265, 267, 268, 269, 276, 276, 290, 295, 301, 306, 312, 396]
33 396

In [9]:
print(list(marks_series))
print(dict(marks_series))

[60, 60, 58, 60]
{'Maths': np.int64(60), 'Hindi': np.int64(60), 'Computer': np.int64(58), 'EVS': np.int64(60)}

Arithmetic Operations -> All the arithmetic operators are applicable

In [16]:
100 - marks_series

Maths       40
Hindi       40
Computer    42
EVS         40
Name: Mere number, dtype: int64

Relational operations -> All the relational operators are applicable

In [20]:
marks_series >= 60

Maths        True
Hindi        True
Computer    False
EVS          True
Name: Mere number, dtype: bool

Boolean Indexing on series ->

In [ ]:
# Find no.of 50s and 100s scored by kohli
kohli = (pd.read_csv("/home/aaditya/Downloads/kohli_ipl.csv", index_col = "match_no")).squeeze()

kohli[kohli >= 50].size

# Find no.of ducks
kohli[kohli == 0].size

# Count the number of day when I had more than 200 subs a day
subs[subs > 200].size

# Find actors who have done more than 20 movies
num_movies = movies.value_counts()
num_movies
num_movies[num_movies > 20]

lead
Akshay Kumar        48
Amitabh Bachchan    45
Ajay Devgn          38
Salman Khan         31
Sanjay Dutt         26
Shah Rukh Khan      22
Emraan Hashmi       21
Name: count, dtype: int64